# BuiltInFailures.ExtrusionFailures Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..ExtrusionFailures Properties
BuiltInFailures..::..ExtrusionFailures Class See Also
---
The BuiltInFailures..::..ExtrusionFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CannotDrawExtrusions | Can't make Extrusion. |
| CannotDrawExtrusionsError | Can't make Extrusion. |
| ExtrusionTooThin | Extrusion is too thin. |
| InvalidExtrusionCurveloop | Base sketch for extrusion is invalid. |
| InvalidExtrusionCurveloopError | Base sketch for extrusion is invalid. |

# See Also
BuiltInFailures..::..ExtrusionFailures Class
Autodesk.Revit.DB Namespace